# Modified YOLOv5s model using MobileNetV3 backbone + BiFPN neck
# According to "Research on Foreign Object Intrusion Detection for Railway Tracks..."

nc: 3  # number of classes (vehicle, pedestrian, rockfall)
depth_multiple: 0.33
width_multiple: 0.50

anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]
  - [116,90, 156,198, 373,326]

backbone:
  # MobileNetV3-like structure
  [[-1, 1, Conv, [16, 3, 2]],
   [-1, 1, BottleneckCSP, [32, 3, 2]],
   [-1, 1, BottleneckCSP, [64, 3, 2]],
   [-1, 2, BottleneckCSP, [128, 3, 2]],
   [-1, 1, SPPF, [128, 5]]]

neck:
  # BiFPN-like neck replacing PANet
  [[-1, 1, Conv, [128, 1, 1]],
   [-1, 1, Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # FPN fusion
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 4], 1, Concat, [1]],  # BiFPN fusion
   [-1, 1, Conv, [256, 3, 1]]]

head:
  [[-1, 1, Detect, [nc, anchors]]]
